cases/base/pipecyl20m/0/k
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
\*---------------------------------------------------------------------------*/

FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      k;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

// Intensidad de turbulencia ~5 % -> k ~ 0.034 m2/s2
internalField   uniform 0.034;

boundaryField
{
    inlet
    {
        type            fixedValue;
        value           uniform 0.034;
    }

    outlet
    {
        type            zeroGradient;
    }

    walls
    {
        type            kqRWallFunction;
        value           uniform 0.034;
    }
}

// ************************************************************************* //
