cases/base/pipecyl20m/0/omega
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
\*---------------------------------------------------------------------------*/

FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      omega;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 -1 0 0 0 0];

// Escala de longitud ~ 0.07*D -> omega ~ 14 1/s
internalField   uniform 14;

boundaryField
{
    inlet
    {
        type            fixedValue;
        value           uniform 14;
    }

    outlet
    {
        type            zeroGradient;
    }

    walls
    {
        type            omegaWallFunction;
        value           uniform 14;
    }
}

// ************************************************************************* //
