cases/base/pipecyl20m/system/fvSchemes
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  11                                    |
|   \\  /    A nd           | Web:      www.openfoam.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/

FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSchemes;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

ddtSchemes
{
    default         steadyState;
}

gradSchemes
{
    default         Gauss linear;
    grad(p)         Gauss linear;
    grad(U)         Gauss linear;
    grad(k)         Gauss linear;
    grad(omega)     Gauss linear;
}

divSchemes
{
    div(phi,U)              Gauss linearUpwind grad(U);
    div(phi,k)              Gauss upwind;
    div(phi,omega)          Gauss upwind;
    div(phi,nuTilda)        Gauss upwind;
    div((nuEff*dev2(T(grad(U))))) Gauss linear;
}

laplacianSchemes
{
    default         Gauss linear corrected;
}

interpolationSchemes
{
    default         linear;
}

snGradSchemes
{
    default         corrected;
}

// Nuevo: cálculo de distancia a la pared
wallDist
{
    method  meshWave;
}

fluxRequired
{
    default         no;
    p;
}

// ************************************************************************* //
